backend-api/app/Controllers/AnggotaController.php

SELECT *
FROM `anggota`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new AnggotaModel();
        $data  = $model->orderBy('id', 'DESC')->findAll();