backend-api/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `token` = 'fd06253403ca8043fdb0afedd0a7ddf2f2692d01c73de21cce1c7a267d85cc4d'
 LIMIT 1
UPDATE `users` SET `token` = NULL, `updated_at` = '2026-06-10 13:57:09'
WHERE `users`.`id` IN ('1')
---
    public function logout()
    {
        $token = $this->request->getHeaderLine('Authorization');
        $token = str_replace('Bearer ', '', $token);

        if (!$token) {
            return $this->failUnauthorized('Token tidak ada.');
        }

        $userModel = new UserModel();
        $user      = $userModel->where('token', $token)->first();

        if ($user) {
            $userModel->update($user['id'], ['token' => null]);