backend-api/app/Controllers/GenreController.php

    public function index()
    {
        $model = new GenreModel();
        $data  = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `genre`
ORDER BY `id` DESC