backend-api/app/Controllers/KomikController.php

SELECT `komik`.*, `genre`.`nama_genre`, `penulis`.`nama` as `nama_penulis`
FROM `komik`
JOIN `genre` ON `genre`.`id` = `komik`.`genre_id`
JOIN `penulis` ON `penulis`.`id` = `komik`.`penulis_id`
ORDER BY `komik`.`id` DESC
---
    public function index()
    {
        $model  = new KomikModel();
        $search = $this->request->getGet('search');
        $genre  = $this->request->getGet('genre_id');

        $builder = $model->select('komik.*, genre.nama_genre, penulis.nama as nama_penulis')
            ->join('genre', 'genre.id = komik.genre_id')
            ->join('penulis', 'penulis.id = komik.penulis_id');

        if ($search) {
            $builder->groupStart()
                ->like('komik.judul', $search)
                ->orLike('penulis.nama', $search)
                ->groupEnd();
        }

        if ($genre) {
            $builder->where('komik.genre_id', $genre);
        }

        $data = $builder->orderBy('komik.id', 'DESC')->findAll();