backend-api/app/Controllers/PeminjamanController.php

    public function index()
    {
        $model = new PeminjamanModel();
        $data  = $model->select('peminjaman.*, komik.judul as judul_komik, anggota.nama as nama_anggota')
            ->join('komik', 'komik.id = peminjaman.komik_id')
            ->join('anggota', 'anggota.id = peminjaman.anggota_id')
            ->orderBy('peminjaman.id', 'DESC')
            ->findAll();
---
SELECT `peminjaman`.*, `komik`.`judul` as `judul_komik`, `anggota`.`nama` as `nama_anggota`
FROM `peminjaman`
JOIN `komik` ON `komik`.`id` = `peminjaman`.`komik_id`
JOIN `anggota` ON `anggota`.`id` = `peminjaman`.`anggota_id`
ORDER BY `peminjaman`.`id` DESC

    public function create()
    {
        $json  = $this->request->getJSON(true);
        $rules = [
            'komik_id'   => 'required|integer',
            'anggota_id' => 'required|integer',
            'tgl_pinjam' => 'required',
        ];

        if (!$this->validateData($json ?? [], $rules)) {
            return $this->failValidationErrors($this->validator->getErrors());
        }

        // Kurangi stok komik
        $komikModel = new KomikModel();
        $komik      = $komikModel->find($json['komik_id']);
        if (!$komik || $komik['stok'] < 1) {
            return $this->fail('Stok komik habis atau tidak tersedia.');
        }
        $komikModel->update($json['komik_id'], [
            'stok'   => $komik['stok'] - 1,
            'status' => ($komik['stok'] - 1 > 0) ? 'tersedia' : 'habis',
        ]);

        $model = new PeminjamanModel();
        $id    = $model->insert([
            'komik_id'   => $json['komik_id'],
            'anggota_id' => $json['anggota_id'],
            'tgl_pinjam' => $json['tgl_pinjam'],
            'status'     => 'dipinjam',
        ]);
---
SELECT *
FROM `komik`
WHERE `komik`.`id` = '9'
UPDATE `komik` SET `stok` = 4, `status` = 'tersedia', `updated_at` = '2026-06-10 12:29:26'
WHERE `komik`.`id` IN ('9')
INSERT INTO `peminjaman` (`komik_id`, `anggota_id`, `tgl_pinjam`, `status`, `created_at`, `updated_at`) VALUES ('9', '6', '2026-06-10', 'dipinjam', '2026-06-10 12:29:26', '2026-06-10 12:29:26')

    public function stats()
    {
        $model = new PeminjamanModel();
        $komikModel = new KomikModel();

        $total_dipinjam    = $model->where('status', 'dipinjam')->countAllResults();
        $total_dikembalikan = $model->where('status', 'dikembalikan')->countAllResults();
        $total_komik       = $komikModel->countAllResults();
        $total_tersedia    = $komikModel->where('status', 'tersedia')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dipinjam'
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'dikembalikan'
SELECT COUNT(*) AS `numrows`
FROM `komik`
SELECT COUNT(*) AS `numrows`
FROM `komik`
WHERE `status` = 'tersedia'