backend-api/app/Controllers/PenulisController.php

SELECT *
FROM `penulis`
ORDER BY `id` DESC
---
    public function index()
    {
        $model = new PenulisModel();
        $data  = $model->orderBy('id', 'DESC')->findAll();