backend-api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $authHeader = $request->getHeaderLine('Authorization');

        if (!$authHeader || !str_starts_with($authHeader, 'Bearer ')) {
            return service('response')
                ->setStatusCode(401)
                ->setJSON(['status' => false, 'message' => 'Token tidak ada. Akses ditolak.']);
        }

        $token = str_replace('Bearer ', '', $authHeader);

        $userModel = new UserModel();
        $user      = $userModel->where('token', $token)->first();
---
SELECT *
FROM `users`
WHERE `token` = 'fd06253403ca8043fdb0afedd0a7ddf2f2692d01c73de21cce1c7a267d85cc4d'
 LIMIT 1